Repository: stepanzubkov/thonny-florgon
Catalog: thonny/locale/*/LC_MESSAGES/thonny.po
Languages: cs_cz, th_th

source: Assistant
cs_cz: Asistent
th_th: ผู้ช่วย

source: Name
cs_cz: Jméno
th_th: ชื่อ

source: Modified
cs_cz: Změněno
th_th: ที่ได้รับการแก้ไข

source: Size (bytes)
cs_cz: Velikost (v bajtech)
th_th: ขนาด (ไบต์)

source: %d items
cs_cz: %d položek
th_th: %d รายการ

source: Storage space on this drive or filesystem
th_th: พื้นที่เก็บข้อมูลในไดรฟ์หรือระบบไฟล์นี้

source: total space
th_th: พื้นที่ทั้งหมด

source: used space
th_th: พื้นที่ที่ใช้

source: free space
cs_cz: volné místo
th_th: พื้นที่ว่าง

source: Storage info
th_th: ข้อมูลการสตอร์เรจ

source: Refresh
cs_cz: Obnovit
th_th: รีเฟรช

source: Open in system file manager
cs_cz: Otevřít v systémovém správci souborů
th_th: เปิดในตัวจัดการไฟล์ระบบ

source: Focus into
cs_cz: Přepnout do
th_th: โฟกัสไปที่

source: Open in Thonny
cs_cz: Otevřít v Thonny
th_th: เปิดใน Thonny

source: Open in default external app
cs_cz: Otevřít ve výchozí externí aplikaci
th_th: เปิดในแอปภายนอกเริ่มต้น

source: Configure %s files
cs_cz: Nastavit %s soubory
th_th: กำหนดค่า %s ไฟล์

source: Hide hidden files
cs_cz: Skrýt skryté soubory
th_th: ซ่อนไฟล์ที่ซ่อนอยู่

source: Show hidden files
cs_cz: Zobrazit skryté soubory
th_th: แสดงไฟล์ที่ซ่อนอยู่

source: Open in system default app
cs_cz: Otevřít v systémové výchozí aplikaci
th_th: เปิดในแอปเริ่มต้นของระบบ

source: Open in Thonny's text editor
cs_cz: Otevřít v editoru v Thonny
th_th: เปิดในโปรแกรมแก้ไขข้อความของ Thonny

source: What to do with a %s file when you double-click it in Thonny's file browser?
cs_cz: Co se má stát s %s souborem když na něj poklepete v Thonnyho souborovém dialogu?
th_th: จะทำอย่างไรกับไฟล์ %s เมื่อคุณดับเบิลคลิกในไฟล์เบราว์เซอร์ของ Thonny

source: New file
cs_cz: Nový soubor
th_th: ไฟล์ใหม่

source: New directory
cs_cz: Nový adresář
th_th: ไดเร็คทอรี่ใหม่

source: Cut
cs_cz: Vyjmout
th_th: ตัด

source: Copy
cs_cz: Kopírovat
th_th: คัดลอก

source: Paste
cs_cz: Vložit
th_th: วาง

source: Rename
cs_cz: Přejmenovat
th_th: เปลี่ยนชื่อ

source: Move to Trash
cs_cz: Přesunout do koše
th_th: ย้ายไปยังถังขยะ

source: Delete
cs_cz: Smazat
th_th: ลบ

source: Properties
cs_cz: Vlastnosti
th_th: คุณสมบัติ

source: Storage space
cs_cz: Úložiště
th_th: พื้นที่จัดเก็บ

source: Path
cs_cz: Cesta
th_th: เส้นทาง

source: Directory properties
cs_cz: Vlastnosti adresáře
th_th: คุณสมบัติไดเร็กทอรี

source: File properties
cs_cz: Vlastnosti souboru
th_th: คุณสมบัติของไฟล์

source: bytes
cs_cz: bajtů
th_th: ไบต์

source: Size
cs_cz: Velikost
th_th: ขนาด

source: Deleting %s
cs_cz: Mažu %s
th_th: กำลังลบ %s

source: Moving to Trash
cs_cz: Přesouvám do koše
th_th: กำลังย้ายไปถังขยะ

source: Move %s to Trash?
cs_cz: Přesunout '%s' do koše?
th_th: ย้าย %s ไปยังถังขยะหรือไม่?

source: Moving %s to Trash
cs_cz: Přesouvám '%s' do koše
th_th: ย้าย %s ไปยังถังขยะ

source: Enter name for new directory under %s
cs_cz: Zadejte jméno nové složky v %s
th_th: ป้อนชื่อสำหรับไดเรกทอรีใหม่ภายใต้ %s

source: Nothing selected
cs_cz: Nic není vybráno
th_th: ไม่มีอะไรที่เลือก

source: Select an item and try again!
cs_cz: Vyberte položku a zkuste to znovu!
th_th: เลือกรายการแล้วลองอีกครั้ง!

source: Rename '%s'
cs_cz: Přejmenovat '%s'
th_th: เปลี่ยนชื่อ '%s'

source: Enter new name
cs_cz: Zadejte nové jméno
th_th: ใส่ชื่อใหม่

source: Paste failed
cs_cz: Vkládání se nezdařilo
th_th: การวางล้มเหลว

source: There are conflicting folders
th_th: มีโฟลเดอร์ที่ขัดแย้งกัน

source: File already exists
cs_cz: Soubor již existuje
th_th: มีไฟล์อยู่แล้ว

source: Not supported
th_th: ไม่รองรับแล้ว

source: Opening remote files in external app is not supported.
cs_cz: Otevírání vzdálených souborů v externí aplikaci není podporováno.
th_th: ไม่รองรับการเปิดไฟล์ระยะไกลในแอปภายนอกไม่รองรับ

source: If it is a text file, then you can configure it to open in Thonny by right-clicking it and selecting 'Configure ... files'.
th_th: หากเป็นไฟล์ข้อความคุณสามารถกำหนดค่าให้เปิดใน Thonny ได้โดยคลิกขวาและเลือก 'กำหนดค่า ... ไฟล์'

source: If the file needs to be opened in external app, then download it to a local directory and open it from there!
cs_cz: Pokud je potřeba otevřít soubor v externí aplikaci, uložte jej do lokální složky a otevřete jej odtamtud!
th_th: หากไฟล์จะต้องเปิดในแอปภายนอกให้ดาวน์โหลดไปยังไดเรกทอรีท้องถิ่นและเปิดจากที่นั่น!

source: Deleting
th_th: กำลังลบ

source: Creating directory
th_th: สร้างไดเร็คทอรี่

source: Open from %s
cs_cz: Otevřít z '%s'
th_th: เปิดจาก %s

source: Save to %s
cs_cz: Uložit do '%s'
th_th: บันทึกไปยัง %s

source: File name:
cs_cz: Jméno souboru:
th_th: ชื่อไฟล์:

source: OK
th_th: ตกลง

source: Cancel
cs_cz: Zrušit
th_th: ยกเลิก

source: Error
cs_cz: Chyba
th_th: ผิดพลาด

source: You need to select a file!
cs_cz: Musíte vybrat soubor!
th_th: คุณจำเป็นต้องเลือกไฟล์!

source: Overwrite?
cs_cz: Přepsat?
th_th: เขียนทับหรือเปล่า?

source: Do you want to overwrite '%s' ?
cs_cz: Chcete přepsat '%s'?
th_th: คุณต้องการเขียนทับ '%s' หรือไม่?

source: This computer
cs_cz: Tento počítač
th_th: คอมพิวเตอร์เครื่องนี้

source: Thonny options
cs_cz: Volby Thonny
th_th: ตัวเลือก Thonny

source: Python files
cs_cz: Pythonové soubory
th_th: ไฟล์ Python

source: all files
cs_cz: všechny soubory
th_th: ไฟล์ทั้งหมด

source: <untitled>
cs_cz: <bez názvu>
th_th: <ไม่มีชื่อ>

source: File is gone
th_th: ไฟล์หายไป

source: Looks like '%s' was deleted or moved.
cs_cz: Zdá se že '%s' byl smazán nebo přesunut.
th_th: ดูเหมือนว่า '%s' ถูกลบหรือย้าย

source: Do you want to also close the editor?
th_th: คุณต้องการปิดเอดิเตอร์รหรือไม่

source: External modification
cs_cz: Externí modifikace
th_th: การปรับเปลี่ยนจากภายนอก

source: Looks like '%s' was modified outside of the editor.
cs_cz: Vypadá to že '%s' byl změněný mimo editor.
th_th: ดูเหมือนว่า '%s' ถูกปรับเปลี่ยนนอกเอดิเตอร์

source: Do you want to discard current editor content and reload the file from disk?
th_th: คุณต้องการยกเลิกเนื้อหาของโปรแกรมที่แก้ไขปัจจุบันและโหลดไฟล์ใหม่จากดิสก์ใช่หรือไม่?

source: Problem
cs_cz: Problém
th_th: ปัญหา

source: Loading %s
th_th: กำลังโหลด %s

source: Loading
cs_cz: Nahrávám
th_th: กำลังโหลด

source: Saving to %s
th_th: บันทึกไปยัง %s

source: Saving
cs_cz: Ukládám
th_th: กำลังบันทึก

source: Could not save
cs_cz: Ukládání se nezdařílo
th_th: ไม่สามารถบันทึกได้

source: Confirmation
cs_cz: Potvrzení
th_th: การยืนยัน

source: Python files usually have .py extension.
cs_cz: Pythonové soubory mají obvykle příponu .py.
th_th: ไฟล์ Python มักจะมีนามสกุล .py

source: Did you mean '%s'?
cs_cz: Měli jste na mysli '%s'?
th_th: คุณหมายถึง '%s' หรือไม่?

source: New
cs_cz: Nový
th_th: ใหม่

source: Open...
cs_cz: Otevřít...
th_th: เปิด...

source: Load
cs_cz: Nahrát
th_th: โหลด

source: Recent files
cs_cz: Nedávné soubory
th_th: ไฟล์ล่าสุด

source: Close
cs_cz: Zavřít
th_th: ปิด

source: Close all
cs_cz: Zavřít vše
th_th: ปิดทั้งหมด

source: Save
cs_cz: Uložit
th_th: บันทึก

source: Save All files
cs_cz: Uložit všechny soubory
th_th: บันทึกไฟล์ทั้งหมด

source: Save as...
cs_cz: Uložit jako...
th_th: บันทึกเป็น...

source: Save copy...
cs_cz: Uložit kopii...
th_th: บันทึกสำเนา...

source: Move / rename...
cs_cz: Přesunout / přejmenovat...
th_th: ย้าย/ เปลี่ยนชื่อ...

source: Go to line...
cs_cz: Přejít na řádek...
th_th: ไปยังบรรทัด...

source: Go to line
cs_cz: Přejít na řádek
th_th: ไปยังบรรทัด

source: Line number
cs_cz: Číslo řádku
th_th: หมายเลขบรรทัด

source: Do you want to save files before closing?
cs_cz: Chcete soubory uložit před zavřením?
th_th: คุณต้องการบันทึกไฟล์ก่อนปิดหรือไม่?

source: Do you want to save file before closing?
cs_cz: Chcete soubor uložit před zavřením?
th_th: คุณต้องการบันทึกไฟล์ก่อนปิดหรือไม่?

source: Save On Close
cs_cz: Uložit při zavření
th_th: บันทึกตอนปิด

source: Value ID
th_th: ค่า ID

source: Value
cs_cz: Hodnota
th_th: ค่า

source: Could not find disk '%s'. Do you want to locate it yourself?
cs_cz: Nenalezen disk '%s'. Chcete jej najít sám(a)?
th_th: ไม่พบดิสก์ '%s' คุณต้องการค้นหาด้วยตัวเองหรือไม่?

source: Found several '%s' disks. Do you want to choose one yourself?
cs_cz: Nalezeno několik '%s' disků. Chcete jeden vybrat?
th_th: พบดิสก์ '%s' หลายแผ่น คุณต้องการเลือกด้วยตัวเองหรือไม่?

source: Can't find suitable disk
cs_cz: Není možné najít vhodný disk
th_th: ไม่พบดิสก์ที่เหมาะสม

source: Command not available
cs_cz: Příkaz není k dispozici
th_th: ไม่สามารถใช้คำสั่งได้

source: This command is not available if Thonny is run via Flatpak
cs_cz: Tento příkaz není k dispozici v Thonny spuštěném z Flatpacku
th_th: คำสั่งนี้ไม่สามารถใช้ได้หาก Thonny ทำงานผ่าน Flatpak

source: Run current script
cs_cz: Spustit aktuální skript
th_th: เรียกใช้สคริปต์ปัจจุบัน

source: Run current script in terminal
cs_cz: Spustit aktuální skript v terminálu
th_th: เรียกใช้สคริปต์ปัจจุบันในเทอร์มินัล

source: Stop/Restart backend
cs_cz: Zastavit/restartovat backend
th_th: หยุด/รีสตาร์ทแบ็กเอนด์

source: Stop
cs_cz: Zastavit
th_th: หยุด

source: Interrupt execution
cs_cz: Přerušit běh
th_th: การดำเนินการขัดจังหวะ

source: Send EOF / Soft reboot
cs_cz: Poslat EOF / Soft reboot
th_th: สิ้นสุด EOF / ซอฟต์รีบูต

source: Disconnect
cs_cz: Odpojit
th_th: ตัดการเชื่อมต่อ

source: Clear shell
cs_cz: Smazat shell
th_th: เคลียร์เชลล์

source: Shell
th_th: เชลล์

source: Plotter
th_th: พล็อตเตอร์

source: Clear
cs_cz: Smazat
th_th: เคลียร์

source: Show Plotter
cs_cz: Zobrat Plotter
th_th: แสดงพล็อตเตอร์

source: For performance reasons, Shell avoids showing very long lines in full (see Tools => Options => Shell). Here you can interact with the original text fragment.
cs_cz: Z důvodů výkonu se Shell vyhýbá zobrazování velmi dlouhých řádků v plné délce (viz Nástroje => Možnosti => Shell). Zde můžete pracovat s původním fragmentem textu.
th_th: ด้วยเหตุผลด้านประสิทธิภาพ Shell หลีกเลี่ยงการแสดงบรรทัดที่ยาวมาก (ดู เครื่องมือ => ตัวเลือก => เชลล์) คุณสามารถโต้ตอบกับส่วนข้อความต้นฉบับได้ที่นี่

source: Wrap text (may be slow)
cs_cz: Zalomte text (může být pomalý)
th_th: ตัดข้อความ (อาจช้า)

source: Squeezed text (%d characters)
cs_cz: Zkrátit text (%d znaků)
th_th: บีบข้อความ (%d อักขระ)

source: Plotter visualizes series of numbers printed to the Shell.
cs_cz: Plotter vykresluje řady čísel vypsaných do Shellu
th_th: พล็อตเตอร์แสดงภาพชุดของ ตัวเลขที่พิมพ์ไปที่เชลล์

source: See Help for details.
cs_cz: Detaily viz nápověda
th_th: ดูความช่วยเหลือสำหรับรายละเอียด

source: Close others
cs_cz: Zavřít ostatní
th_th: ปิดอันอื่น

source: Copying
cs_cz: Kopíruji
th_th: กำลังคัดลอก

source: Copying %s to %s
cs_cz: Kopíruji %s do %s
th_th: กำลังคัดลอก %s ไปยัง %s

source: Copy to clipboard
cs_cz: Zkopírovat do schránky
th_th: คัดลอกไปยังคลิปบอร์ด

source: Select All
cs_cz: Vybrat vše
th_th: เลือกทั้งหมด

source: File
cs_cz: Soubor
th_th: ไฟล์

source: Edit
cs_cz: Upravit
th_th: แก้ไข

source: View
cs_cz: Zobrazení
th_th: ดู

source: Tools
cs_cz: Nástroje
th_th: เครื่องมือ

source: Help
cs_cz: Nápověda
th_th: ช่วยเหลือ

source: Exit
cs_cz: Konec
th_th: ออก

source: Options...
cs_cz: Volby...
th_th: ตัวเลือก...

source: Increase font size
cs_cz: Zvětšit velikost písma
th_th: เพิ่มขนาดฟอนต์

source: Decrease font size
cs_cz: Zmenšit velikost písma
th_th: ลดขนาดฟอนต์

source: Focus editor
cs_cz: Přepnout do editoru
th_th: โฟกัสตัวแก้ไข

source: Focus shell
cs_cz: Přepnout do shellu
th_th: โฟกัส Shell

source: Maximize view
cs_cz: Maximalizovat okno
th_th: ขยายมุมมองสูงสุด

source: Full screen
cs_cz: Celá obrazovka
th_th: เต็มหน้าจอ

source: Change font size
cs_cz: Změnit velikost písma
th_th: เปลี่ยนขนาดฟอนต์

source: Zoom
cs_cz: Zvětšit
th_th: ซูม

source: Exit Thonny
cs_cz: Ukončit Thonny
th_th: ออกจาก Thonny

source: Quit
cs_cz: Ukončit
th_th: จบการทำงาน

source: Support
cs_cz: Podpora
th_th: การสนับสนุน

source: Configure interpreter...
th_th: ปรับแต่งอินเตอร์พรีทเตอร์...

source: Overwriting theme '%s'
cs_cz: Přepsat motiv '%s'
th_th: การเขียนทับธีม '%s'

source: Program arguments:
cs_cz: Argumenty programu:
th_th: โปรแกรมอาร์กิวเมนต์

source: Program arguments
cs_cz: Argumenty programu
th_th: อาร์กิวเมนต์ของโปรแกรม

source: Switch to regular mode
cs_cz: Přepnout do běžného režimu
th_th: เปลี่ยนเป็น ปกติ โหมด

source: Regular mode
cs_cz: Obvyklý mód
th_th: โหมดปกติ

source: Configuration has been updated. Restart Thonny to start working in regular mode. (See 'Tools → Options → General' if you change your mind later.)
cs_cz: Konfigurace byla změněna. Restartujte Thonny pro práci v normálním módu. (Pro změnu jděte do "Nástroje - Volby - Obecné)
th_th: อัปเดตการกำหนดค่าแล้ว รีสตาร์ท Thonny เพื่อเริ่มทำงานในโหมดปกติ (ดู 'เครื่องมือ → ตัวเลือก → ทั่วไป' หากคุณเปลี่ยนใจในภายหลัง)

source: Device
cs_cz: Zařízení
th_th: อุปกรณ์

source: Cancelling
th_th: กำลังยกเลิก

source: Starting
th_th: กำลังเริ่มต้น

source: About Thonny
cs_cz: O Thonny
th_th: เกี่ยวกับ Thonny

source: Made in University of Tartu, Estonia, with the help from open-source community, Raspberry Pi Foundation and Cybernetica AS
cs_cz: Vytvořeno v University of Tartu, Estonia, s pomocí komunity open-source, Raspberry Pi Foundation a Cybernetica AS
th_th: พัฒนาโดย มหาวิทยาลัยแห่ง Tartu, Estonia, ด้วยความช่วยเหลือจาก ชุมชน Open-source, Raspberry Pi Foundation และ Cybernetica AS

source: This program comes with ABSOLUTELY NO WARRANTY! It is free software, and you are welcome to redistribute it under certain conditions, see https://opensource.org/licenses/MIT for details
cs_cz: Tento program je šířen BEZ JAKÉKOLI ZÁRUKY! Jedná se o svobodný software a jeho šíření v souladu s licencí je vítáno, viz https://opensource.org/licenses/MIT
th_th: โปรแกรมนี้ ไม่มีการรับประกัน! นี่คือซอฟต์แวร์ฟรี และคุณสามารถ แจกจ่ายภายใต้เงื่อนไข ดูที่ https://opensource.org/licenses/MIT สำหรับรายละเอียด

source: Version history
cs_cz: Historie verzí
th_th: ประวัติของเวอร์ชั่นต่างๆ

source: Report problems
cs_cz: Nahlásit problém
th_th: แจ้งปัญหา

source: Open Assistant automatically when program crashes with an exception
cs_cz: Otevřít Asistenta automaticky pokud program skončí výjimkou
th_th: เปิดผู้ช่วยทันที เมื่อโปรแกรมขัดข้องพร้อมข้อผิดพลาด

source: Open Assistant automatically when it has warnings for your code
cs_cz: Otevřít Asistenta automaticky když má varování pro váš kód
th_th: เปิดผู้ช่วยทันที เมื่อมีการเตือนในโค้ดของคุณ

source: Perform selected Pylint checks
cs_cz: Provést vybranou Pylint kontolu
th_th: ตรวจสอบส่วนที่เลือกด้วย Pylint

source: Perform MyPy checks
cs_cz: Provést MyPy kontrolu
th_th: ทำการตรวจสอบ MyPy

source: Disabled checks (one id per line)
cs_cz: vypnout kontrolu (jedno id na řádek)
th_th: ปิดการตรวจสอบ (หนึ่ง ID ต่อบรรทัด)

source: Program tree
cs_cz: Strom programu
th_th: โครงสร้างโปรแกรม

source: Which kind of interpreter should Thonny use for running your code?
cs_cz: Který interpretr má Thonny použít ke spuštění vašeho kódu?
th_th: Thonny ควรใช้อินเตอร์พรีทเตอร์ประเภทใดในการรันโค้ดของคุณ?

source: Details
cs_cz: Detaily
th_th: รายละเอียด

source: Enter the passphrase of your private key for {}
th_th: ป้อนรหัสผ่านของรหัสส่วนตัวของคุณสำหรับ {}

source: Enter your password for {}
cs_cz: Zadejte svoje heslo pro {}
th_th: ป้อนรหัสผ่านของคุณสำหรับ {}

source: Save password
cs_cz: Uložit heslo
th_th: บันทึกรหัสผ่าน

source: Interpreter
th_th: อินเตอร์พรีทเตอร์

source: About Birdseye
cs_cz: O Birdseye
th_th: เกี่ยวกับ Birdseye

source: Birdseye is a Python debugger which needs to be installed separately. Do you want to open the help page and learn more?
cs_cz: Birdseye je Debuger Pythonu, který musí být instalován samostatně. Chcete otevřít nápovědu a dozvědět se více?
th_th: Birdseye เป็นดีบักเกอร์ของ Python ที่ต้องติดตั้งแยกต่างหาก

source: Debug current script (birdseye)
cs_cz: Debugovat aktuální skript (birdseye)
th_th: ดีบักสคริปต์ปัจจุบัน (birdseye)

source: Show parameter info
cs_cz: Zobrazit informace o parameterech
th_th: แสดงข้อมูลพารามิเตอร์

source: Indent selected lines
cs_cz: Zvětšit odstazení o úroveň
th_th: เยื้องบรรทัดที่เลือก

source: Dedent selected lines
cs_cz: Zmenšit odstazení o úroveň
th_th: เยื้องบรรทัดที่เลือก

source: Replace tabs with spaces
cs_cz: Nahradit tabulátory mezerami
th_th: แทนที่แท็บด้วยช่องว่าง

source: Comment out
cs_cz: Zakomentovat
th_th: ทำเป็นคอมเมนต์

source: Uncomment
cs_cz: Odkomentovat
th_th: ยกเลิกคอมเมนต์

source: Undo
cs_cz: Zpět
th_th: เลิกทำ

source: Redo
cs_cz: Vpřed
th_th: คืนค่า

source: Select all
cs_cz: Vybrat vše
th_th: เลือกทั้งหมด

source: Run to cursor
cs_cz: Skoč na kurzor
th_th: วิ่งไปที่เคอร์เซอร์

source: Function call at %s
cs_cz: Volání funkce na %s
th_th: ฟังก์ชั่นเรียกที่ %s

source: Can't close yet
cs_cz: ještě není možné zavřít
th_th: ยังปิดไม่ได้

source: Use "Stop" command if you want to cancel debugging
cs_cz: Použijte "Stop" příkaz pro ukončení debuggingu
th_th: ใช้คำสั่ง "หยุด" หากคุณต้องการยกเลิกการดีบัก

source: Local variables
cs_cz: Lokální proměnné
th_th: ตัวแปรโลคอล

source: Function
cs_cz: Funkce
th_th: ฟังก์ชั่น

source: Location
th_th: ที่ตั้ง

source: If last command raised an exception then this view will show the stacktrace.
th_th: หากคำสั่งสุดท้ายยกข้อยกเว้นจากนั้นมุมมองนี้จะแสดง stackstrace

source: Resume
cs_cz: Pokračovat
th_th: เล่นต่อ

source: Run / resume
cs_cz: Spustit / pokračovat
th_th: เรียกใช้ / เล่นต่อ

source: Debug current script
cs_cz: Debugovat aktuální skript
th_th: ดีบักสคริปต์ปัจจุบัน

source: Debug
th_th: ดีบัก

source: Debug current script (nicer)
cs_cz: Debugovat aktuální skript (hezčí)
th_th: ดีบักสคริปต์ปัจจุบัน (ดีกว่า)

source: Debug current script (faster)
cs_cz: Debugovat aktuální skript (rychlejší)
th_th: ดีบักสคริปต์ปัจจุบัน (เร็วกว่า)

source: Step over
cs_cz: Přeskočit
th_th: ก้าวข้าม

source: Over
cs_cz: Preskočit
th_th: เกินต้องการ

source: Step into
cs_cz: Krok dovnitř
th_th: ก้าวเข้าสู่

source: Into
cs_cz: Dovnitř
th_th: เข้าไป

source: Step out
cs_cz: Krok ven
th_th: ออกมา

source: Out
cs_cz: Ven
th_th: ออก

source: Step back
cs_cz: Krok zpět
th_th: ถอยหลัง

source: Back
cs_cz: Zpět
th_th: ย้อนกลับ

source: Stack
cs_cz: Zásobník
th_th: ซ้อนกัน

source: Exception
cs_cz: Vyjímky
th_th: ยกเว้น

source: Dock user windows
cs_cz: Ukotvit uživatelská okna
th_th: หน้าต่างผู้ใช้ Dock

source: Highlight matching names
cs_cz: Zvýraznit stejná jména
th_th: ไฮไลต์ชื่อที่ตรงกัน

source: Highlight local variables
cs_cz: Zvýraznit lokální proměnné
th_th: ไฮไลต์ตัวแปรโลคอล

source: Highlight parentheses
cs_cz: Zvýrazňovat závorky
th_th: ไฮไลต์วงเล็บ

source: Highlight syntax elements
cs_cz: Zvýrazňovat synaxi
th_th: ไฮไลต์องค์ประกอบไวยากรณ์

source: Highlight tab characters
cs_cz: Zvýraznit znaky tabulátoru
th_th: ไฮไลต์อักขระแท็บ

source: Highlight current line (requires reopening the editor)
cs_cz: Zvýrazňovat aktuální řádek (vyžaduje znovuotevření editoru)
th_th: ไฮไลต์บรรทัดปัจจุบัน (ต้องเปิดโปรแกรมแก้ไขอีกครั้ง)

source: Automatically show parameter info after typing '('
cs_cz: Automaticky zobrazit parametry po napsání '('
th_th: แสดงข้อมูลพารามิเตอร์โดยอัตโนมัติหลังจากพิมพ์ '('

source: Automatically propose completions while typing
cs_cz: Automaticky našeptávat zatímco píšete
th_th: เสนอให้เสร็จสมบูรณ์โดยอัตโนมัติขณะพิมพ์

source: Automatically show documentation for completions
cs_cz: Automaticky zobrazit dokumentaci v našeptávači
th_th: แสดงเอกสารโดยอัตโนมัติสำหรับความสำเร็จ

source: Request completions with Tab-key in editors
th_th: ขอให้เสร็จสมบูรณ์ด้วยแท็บคีย์ในเอดิเตอร์

source: Request completions with Tab-key in Shell
th_th: ขอให้เสร็จสมบูรณ์ด้วยแท็บคีย์ในเชลล์

source: Indent with tab characters (not recommended for Python)
th_th: เยื้องกับตัวละครแท็บ (ไม่แนะนำสำหรับ Python)

source: Show line numbers
cs_cz: Zobrazit čísla řádků
th_th: แสดงหมายเลขบรรทัด

source: Recommended maximum line length (Set to 0 to turn off margin line)
cs_cz: Doporučené maximum znaků na řádek (nastavte 0 pro vypnutí čáry pro konec řádku)
th_th: ความยาวสายสูงสุดที่แนะนำ (ตั้งค่าเป็น 0 เพื่อปิดเส้นระยะขอบ)

source: Editor
th_th: เอดิเตอร์

source: Export usage logs...
cs_cz: Exportovat protokoly využití ...
th_th: ส่งออกบันทึกการใช้งาน...

source: Events
cs_cz: Události
th_th: เหตุการณ์

source: Upload to %s
cs_cz: Nahrát do %s
th_th: อัพโหลดไปยัง %s

source: Download to %s
cs_cz: Stáhnout do %s
th_th: ดาวนืโหลดไปยัง %s

source: Downloading %s to %s
cs_cz: Stahuju %s do %s
th_th: กำลังดาวน์โหลด %s ไปยัง %s

source: Files
cs_cz: Soubory
th_th: ไฟล์

source: Find & Replace
cs_cz: Najít a nahradit
th_th: ค้นหาและแทนที่

source: Find:
cs_cz: Najít:
th_th: ค้นหา

source: Replace with:
cs_cz: Nahradit s:
th_th: แทนที่ด้วย:

source: Up
cs_cz: Nahoru
th_th: ขึ้นบน

source: Down
cs_cz: Dolů
th_th: ลงล่าง

source: Find
cs_cz: Najít
th_th: ค้นหา

source: Replace
cs_cz: Nahradit
th_th: แทนที่

source: Replace+Find
cs_cz: Najít a nahradit
th_th: แทนที่+ค้นหา

source: Replace all
cs_cz: Nahradit vše
th_th: แทนที่ทั้งหมด

source: Enter string to be replaced.
cs_cz: Vložte řetězec k nahrazení
th_th: ป้อนสตริงที่จะแทนที่

source: The specified text was not found!
cs_cz: Text nebyl nalezen
th_th: ไม่พบข้อความที่ระบุ!

source: Allow only single Thonny instance
cs_cz: Povolit pouze jednu instanci Thonny
th_th: อนุญาตเพียงอินสแตนซ์ Thonny เดียวเท่านั้น

source: Log program usage events
cs_cz: Protokolovat události využití programu
th_th: บันทึกเหตุการณ์การใช้งานโปรแกรม

source: Reopen all files from previous session
cs_cz: Otevřít všechny soubory z předchozího sezení
th_th: เปิดไฟล์ทั้งหมดจากเซสชันก่อนหน้าอีกครั้ง

source: Use Tk file dialogs instead of Zenity
cs_cz: Použít Tk souborové dialogy namísto Zenity
th_th: ใช้กล่องโต้ตอบไฟล์ tk แทน Zenity

source: Select if the file dialogs end up behind the main window
th_th: เลือกหากกล่องโต้ตอบไฟล์จบลงหลังหน้าต่างหลัก

source: Disable notification sound
cs_cz: Vypnout notifikační zvuky
th_th: ปิดเสียงการแจ้งเตือน

source: Debug mode (provides more detailed diagnostic logs)
cs_cz: Ladící režim (poskytuje detailnější log)
th_th: โหมดดีบัก (ให้บันทึกการวินิจฉัยที่มีรายละเอียดมากขึ้น)

source: Language
cs_cz: Jazyk
th_th: ภาษา

source: UI mode
cs_cz: Mód UI
th_th: โหมด UI

source: UI scaling factor
cs_cz: UI škálovací faktor
th_th: ปัจจัยการปรับขนาด UI

source: Font scaling mode
cs_cz: Mód škálování písma
th_th: โหมดปรับขนาดอักษร

source: Environment variables (one KEY=VALUE per line)
th_th: ตัวแปรสภาพแวดล้อม (หนึ่งค่า = ค่า ต่อบรรทัด)

source: NB! Restart Thonny after changing these options!
cs_cz: !Restartuje Thonny po těchto změnách!
th_th: หมายเหตุ! รีสตาร์ท Thonny หลังจากเปลี่ยนตัวเลือกเหล่านี้!

source: Warning
cs_cz: Varování
th_th: คำเตือน

source: If you quote the value of an environment variable, the quotes will be part of the value. Did you intend this?
cs_cz: Když napíšete hodnotu proměnné prostředí do uvozovek, tyto uvozovky se stanou součástí hodnoty proměnné. Opravdu to tak chcete udělat?
th_th: หากคุณอ้างอิงค่าของตัวแปรสภาพแวดล้อม เครื่องหมายคำพูดจะเป็นส่วนหนึ่งของค่านั้น คุณตั้งใจสิ่งนี้หรือไม่?

source: General
cs_cz: Obecné
th_th: ทั่วไป

source: Could not find definition
cs_cz: Nepodařilo se najít definici
th_th: ไม่สามารถหาคำนิยามได้

source: Heap mode is on. Close Heap view to turn it off.
cs_cz: Heap mód je zapnutý. Zavřete Heap zobrazení pro jeho vypnutí
th_th: โหมดฮีปเปิดอยู่ ปิดมุมมองฮีปเพื่อปิด

source: Heap
th_th: ฮีป

source: This box is meant for your working notes -- assignment instructions, code snippets, whatever. Everything will be saved automatically and loaded when you open Thonny next time. Feel free to delete this text to make room for your own notes.
cs_cz: Toto pole je určeno pro vaše pracovní poznámky -- k přiřazení úkolů, úryvků kódu, pro cokoli. Všechno se automaticky uloží a načte, když příště otevřete Thonny. Neváhejte tento text smazat a vytvořte si tak prostor pro vlastní poznámky.
th_th: กล่องนี้มีไว้สำหรับบันทึกการทำงานของคุณ -- คำแนะนำในการมอบหมาย ข้อมูลโค้ด หรืออะไรก็ตาม ทุกอย่างจะถูกบันทึกโดยอัตโนมัติและโหลดเมื่อคุณเปิด Thonny ในครั้งต่อไป อย่าลังเลที่จะลบข้อความนี้เพื่อให้มีที่ว่างสำหรับบันทึกย่อของคุณเอง

source: Notes
cs_cz: Poznámky
th_th: โน๊ต
