Repository: stepanzubkov/thonny-florgon
Catalog: thonny/locale/*/LC_MESSAGES/thonny.po
Languages: cs_cz, th_th

source: Data
th_th: ข้อมูล

source: Attributes
th_th: แอททริบิวต์

source: Previous object
cs_cz: Předhozí objekt
th_th: ออปเจ็กต์ก่อนหน้า

source: Next object
cs_cz: následující objekt
th_th: ออปเจ็กต์ถัดไป

source: The representation above is an approximate value of this float. The exact stored value is %s which is about %s
th_th: การเป็นตัวแทนข้างต้นเป็นค่าโดยประมาณของโฟลตนี้ ค่าที่เก็บไว้ที่แน่นอนคือ %s ซึ่งเป็นเรื่องเกี่ยวกับ %s

source: Index
th_th: อินเด็กซ์

source: Key ID
cs_cz: ID klíče
th_th: ID คีย์

source: Key
cs_cz: Klíč
th_th: คีย์

source: Object inspector
cs_cz: Inspektor objektů
th_th: ผู้ตรวจสอบออปเจ็กต์

source: Outline
cs_cz: Osnova
th_th: เค้าร่าง

source: Pygame Zero mode
cs_cz: Pygame Zero mód
th_th: โหมด Pygame Zero

source: Search on PyPI
th_th: ค้นหาใน PyPI

source: Install
cs_cz: Instalace
th_th: ติดตั้ง

source: Upgrade
th_th: อัปเกรด

source: Uninstall
cs_cz: Odinstalovat
th_th: ถอนการติดตั้ง

source: INSTALL
cs_cz: INTALOVAT
th_th: ติดตั้ง

source: Browse the packages
cs_cz: Projít balík
th_th: เรียกดูแพ็คเกจ

source: With current interpreter you can only browse the packages here. Use 'Tools → Open system shell...' for installing, upgrading or uninstalling.
cs_cz: S aktuálním interpreterem zde můžete procházet pouze balíčky. K instalaci, upgradu nebo odinstalaci použijte 'Nástroje → Otevřít systémový shell ...'.
th_th: ด้วยอินเตอร์พรีทเตอร์ปัจจุบัน คุณสามารถเรียกดูแพ็คเกจได้ที่นี่เท่านั้น ใช้ 'เครื่องมือ → เปิดเชลล์ระบบ...' เพื่อติดตั้ง อัปเกรด หรือถอนการติดตั้ง

source: Packages' directory
cs_cz: Adresář balíků
th_th: ไดเรกทอรีของแพ็คเกจ

source: Install from PyPI
cs_cz: Instalovat z PyPI
th_th: ติดตั้งจาก PyPI

source: If you don't know where to get the package from, then most likely you'll want to search the Python Package Index. Start by entering the name of the package in the search box above and pressing ENTER.
cs_cz: Pokud nevíte, odkud balíček získat, pak budete pravděpodobně hledat Python Package Index. Začněte zadáním názvu balíčku do vyhledávacího pole výše a stisknutím klávesy ENTER.
th_th: หากคุณไม่รู้ว่าจะรับแพ็คเกจจากที่ใด เป็นไปได้มากว่าคุณจะต้องการค้นหา Python Package Index เริ่มต้นด้วยการป้อนชื่อแพ็คเกจในช่องค้นหาด้านบนแล้วกด ENTER

source: Install from requirements file
cs_cz: Instalace ze souboru požadavků (requirements.txt)
th_th: ติดตั้งจากไฟล์ข้อกำหนด

source: Click
cs_cz: Klik
th_th: คลิ๊ก

source: here
cs_cz: zde
th_th: ที่นี่

source: to locate requirements.txt file and install the packages specified in it.
cs_cz: vyhledejte soubor requirements.txt a nainstalujte balíčky v něm uvedené.
th_th: เพื่อค้นหาไฟล์ requirements.txt และติดตั้งแพ็คเกจที่ระบุ

source: Install from local file
cs_cz: Instalovat z lokálního souboru
th_th: ติดตั้งจากไฟล์ในเครื่อง

source: Click
cs_cz: Kliknout
th_th: คลิ๊ก

source: to locate and install the package file (usually with .whl, .tar.gz or .zip extension).
cs_cz: najít a nainstalovat soubor balíčku (obvykle s příponou .whl, .tar.gz nebo .zip).
th_th: เพื่อค้นหาและติดตั้งไฟล์แพ็คเกจ (ปกติจะมีนามสกุล .whl, .tar.gz หรือ .zip)

source: Upgrade or uninstall
cs_cz: Upgrade a odinstalace
th_th: อัปเกรดหรือถอนการติดตั้ง

source: Start by selecting the package from the left.
cs_cz: Začněte vybráním balíku vlevo.
th_th: เริ่มต้นด้วยการเลือกแพ็คเกจจากด้านซ้าย

source: This dialog lists all available packages, but allows upgrading and uninstalling only packages from
cs_cz: Tento dialog zobrazuje všechny dostupné balíky, ale umožňuje upgrade nebo odinstalaci pouze z
th_th: กล่องโต้ตอบนี้แสดงรายการแพ็คเกจที่มีอยู่ทั้งหมด แต่อนุญาตให้อัปเกรดและถอนการติดตั้งเฉพาะแพ็คเกจจาก

source: New packages will be also installed into this directory. Other locations must be managed by alternative means.
cs_cz: Do tohoto adresáře budou nainstalovány také nové balíčky. Ostatní místa musí být řízena alternativními prostředky.
th_th: แพ็คเกจใหม่จะถูกติดตั้งลงในไดเร็กทอรีนี้ด้วย สถานที่อื่นต้องได้รับการจัดการด้วยวิธีอื่น

source: Installed version:
cs_cz: Nainstalovaná verze:
th_th: เวอร์ชั่นที่ติดตั้ง:

source: Installed to:
cs_cz: Nainstalováno do:
th_th: ติดตั้งไปที่:

source: Could not find the package from PyPI.
cs_cz: Není možné najít balík z PyPI
th_th: ไม่พบแพ็คเกจจาก PyPI

source: Please check your spelling!
cs_cz: Prosím, zkontrolujte zápis
th_th: กรุณาตรวจสอบการสะกดคำของคุณ!

source: Could not find the package info from PyPI.
cs_cz: Není možné najít informace o balíku z PyPI
th_th: ไม่พบข้อมูลแพ็คเกจจาก PyPI

source: Error code:
cs_cz: Chybový kód:
th_th: รหัสข้อผิดพลาด:

source: Latest stable version
cs_cz: Poslední stabilní verze
th_th: เวอร์ชันเสถียรล่าสุด

source: Latest version
cs_cz: Poslední verze
th_th: เวอร์ชั่นล่าสุด

source: Summary
cs_cz: Souhrn
th_th: สรุป

source: Author
cs_cz: Autor
th_th: ผู้แต่ง

source: Homepage
cs_cz: Domovská stránka
th_th: โฮมเพจ

source: Bugtracker
cs_cz: Butracker
th_th: ตัวติดตามบั๊ก

source: Documentation
cs_cz: Dokumentace
th_th: เอกสาร

source: PyPI page
cs_cz: PyPI stránky
th_th: เพจ PyPI

source: Requires
cs_cz: Vyžaduje
th_th: จำเป็น

source: Search results
cs_cz: Výsledky vyhledávání
th_th: ผลการค้นหา

source: Searching
cs_cz: Vyhledávání
th_th: กำลังค้นหา

source: Can't find package name from the list:
cs_cz: Nemůžu najít balík ze seznamu:
th_th: ไม่พบชื่อแพ็คเกจจากรายการ:

source: Installing '%s'
cs_cz: Instalování '%s'
th_th: กำลังติดตั้ง '%s'

source: Upgrading '%s'
th_th: กำลังอัพเกรด '%s'

source: Uninstalling '%s'
cs_cz: Odinstaluje se '%s'
th_th: กำลังถอนการติดตั้ง '%s'

source: Really uninstall?
cs_cz: Opravdu odinstalovat?
th_th: ต้องการถอนการติดตั้งจริงหรือ?

source: Package '{}' is required for installing and uninstalling other packages.
cs_cz: Balík '{}' je požadován pro instalaci a odinstalaci ostatních balíků
th_th: ต้องใช้แพ็คเกจ '{}' สำหรับการติดตั้งและถอนการติดตั้งแพ็คเกจอื่น

source: Are you sure you want to uninstall it?
cs_cz: Jste si jisti odinstalací?
th_th: คุณแน่ใจหรือไม่ว่าต้องการถอนการติดตั้ง?

source: Installing
th_th: กำลังติดตั้ง

source: Package
cs_cz: Balík
th_th: แพคเก็จ

source: Manage packages for %s
cs_cz: Spravovat balíky pro %s
th_th: จัดการแพคเก็จสำหรับ %s

source: Looks like you are installing a Thonny-related package. If you meant to install a Thonny plugin, then you should choose 'Tools → Manage plugins...' instead Are you sure you want to install %s for the back-end?
cs_cz: Vypadá to že instalujete balík do Thonny. Pokud chcete instalovat Thonny plugin, potom vyberte 'Nástroje - Spáva pluginů' Určitě chcete instalovat %s bro back-end?
th_th: ดูเหมือนว่าคุณกำลังติดตั้งแพ็คเกจที่เกี่ยวข้องกับ Thonny หากคุณต้องการติดตั้งปลั๊กอิน Thonny คุณควร เลือก 'เครื่องมือ → จัดการปลั๊กอิน...' แทน คุณแน่ใจหรือไม่ว่าต้องการติดตั้ง %s สำหรับส่วนหลัง

source: NB! There may be another version available which is compatible with current Thonny version. Click on '...' button to choose the version to install.
cs_cz: !Zřejmě existuje další verze která je kompatibilní s aktuální verzí Thonny. Klikněte na '...' pro výběr verze k instalaci!
th_th: หมายเหตุ! อาจมีรุ่นอื่นที่เข้ากันได้กับรุ่น Thonny ปัจจุบัน คลิกที่ปุ่ม '...' เพื่อเลือกเวอร์ชันที่จะติดตั้ง

source: Thonny plugin without requirements
cs_cz: Thonny plugin bez požaradků
th_th: ปลั๊กอิน Thonny ที่ไม่มีข้อกำหนด

source: Unsuitable requirements
cs_cz: Nesplnitelné požadavky
th_th: ข้อกำหนดที่ไม่เหมาะสม

source: This package requires different Thonny version:
cs_cz: Tento balík vyžaduje jinou verzi Thonny:
th_th: แพ็คเกจนี้ต้องใช้ Thonny เวอร์ชันอื่น:

source: If you still want it, then please install it from the command line.
cs_cz: Pokud to stále chcete, instalujte to z příkazového řádku
th_th: หากคุณยังต้องการอยู่ โปรดติดตั้งจากคอมมานด์ไลน์

source: This dialog is for managing Thonny plug-ins and their dependencies. If you want to install packages for your own programs then choose 'Tools → Manage packages...'
cs_cz: Toto okno je pro správu pluginů Thonny a jejich závislostí. Pokud chcete instalovat pluginy pro vlatní programy, potom vyberte 'Nástroje - Spravovat balíky'
th_th: ไดอะล็อกนี้ใช้สำหรับจัดการปลั๊กอิน Thonny และการขึ้นต่อกัน หากคุณต้องการติดตั้งแพ็คเกจสำหรับโปรแกรมของคุณเอง ให้เลือก 'เครื่องมือ → จัดการแพ็คเกจ...'

source: NB! You need to restart Thonny after installing / upgrading / uninstalling a plug-in.
cs_cz: !Je potřeba resatartovat Thonny po instalaci / upgrade / odinstalaci pluginu!
th_th: หมายเหตุ! คุณต้องรีสตาร์ท Thonny หลังจากติดตั้ง / อัปเกรด / ถอนการติดตั้งปลั๊กอิน

source: Thonny plug-ins
cs_cz: Thonny pluginy
th_th: ปลั๊กอิน Thonny

source: Advanced install / upgrade / downgrade
cs_cz: Rozšířená instalace / upgrade / downgrade
th_th: การติดตั้ง/อัปเกรด/ดาวน์เกรด ขั้นสูง

source: Desired version
cs_cz: Žádaná verze
th_th: รุ่นที่ต้องการ

source: Upgrade dependencies
cs_cz: Závislosti upgrade
th_th: อัพเกรดการพึ่งพา

source: Requires:
cs_cz: Vyžadje:
th_th: จำเป็น:

source: Error:
cs_cz: Chyba:
th_th: ผิดพลาด:

source: Package manager is not available for this interpreter
cs_cz: Správce balíčků není v tomto interpretru dostupný
th_th: ไม่มีตัวจัดการแพ็คเกจสำหรับอินเตอร์พรีทเตอร์นี้

source: Not available
th_th: ไม่ว่าง

source: You need to stop your program before launching the package manager.
th_th: คุณต้องหยุดโปรแกรมของคุณก่อนที่จะเปิดตัวจัดการแพ็คเกจ

source: Manage packages...
cs_cz: Spravovat balíky
th_th: จัดการแพคเก็จ

source: Manage plug-ins...
cs_cz: Spravovat pluginy
th_th: จัดการปลั๊กอิน

source: Open replayer...
cs_cz: Otevřít prohlížeč historie
th_th: เปิดเล่นซ้ำ...

source: Change working directory to script directory on Run / Debug
cs_cz: Změnit pracovní adresář na adresář skriptu při Spuštění / Debugu
th_th: เปลี่ยนไดเร็กทอรีการทำงานเป็นไดเร็กทอรีสคริปต์บน เรียกใช้ / ดีบัก

source: Show function calls (frames) in separate windows
cs_cz: Zobrazit volání funkcí (rámce) v samostatných oknech
th_th: แสดงการเรียกใช้ฟังก์ชัน (เฟรม) ในหน้าต่างแยกกัน

source: Uncheck if you want more traditional experience.
cs_cz: Zrušte zaškrtnutí, pokud chcete více tradiční uživatelské prostředí.
th_th: ยกเลิกการเลือกหากคุณต้องการประสบการณ์แบบเดิมๆ

source: Open and close Stack view automatically
cs_cz: Otevřít a zavřít pohled na zásobník automaticky
th_th: เปิดและปิดสแต็คมุมมองโดยอัตโนมัติ

source: Opens the Stack view on first call and closes it when program returns to main frame.
cs_cz: Otevře první zobrazení zásobníku a zavře jej, když se program vrátí do hlavního snímku.
th_th: เปิดมุมมอง Stack ในการโทรครั้งแรกและปิดเมื่อโปรแกรมกลับสู่เฟรมหลัก

source: Allow stepping into libraries (ie. outside of main script directory)
cs_cz: Umožnit vstupovat do knihoven (například mimo adresář hlavního skriptu)
th_th: อนุญาตให้เข้าสู่ไลบรารี (เช่น นอกไดเร็กทอรีสคริปต์หลัก)

source: May make debugging slower.
cs_cz: Může zpomalit debuging
th_th: อาจทำให้การดีบักช้าลง

source: Preferred debugger
cs_cz: Preferovaný debugger
th_th: ดีบักเกอร์ที่ต้องการ

source: (used when clicking Debug toolbar button)
cs_cz: (používá se po kliknutí na tlačítko Debug na panelu nástrojů)
th_th: (ใช้เมื่อคลิกปุ่ม ทุลบาร์ดีบัก)

source: Birdseye port
th_th: พอร์ตเบิร์ดอาย

source: (restart Thonny after changing this)
cs_cz: (restartujte Thonny po této změně)
th_th: (รีสตาร์ท Thonny หลังจากเปลี่ยนสิ่งนี้)

source: Run & Debug
cs_cz: Spustit & Debugouvat
th_th: เรียกใช้ & ดีบัก

source: Clear Shell before starting new process (Run, Debug, Stop/Restart, ...)
cs_cz: Vyčistit shell před spuštěním nového procesu (Spustit, Debugovat, Zastavit/Restartovat, ...)
th_th: ล้างเชลล์ก่อนเริ่มกระบวนการใหม่ (เรียกใช้, ดีบัก, หยุด/รีสตาร์ท, ...)

source: Terminal emulation
cs_cz: Emulace Terminálu
th_th: การจำลองเทอร์มินัล

source: supports basic ANSI-colors and styles
cs_cz: podporuje základní ANSI barvy a styly
th_th: รองรับสีและสไตล์ ANSI พื้นฐาน

source: Maximum number of lines to keep.
cs_cz: Maximální počet řádků
th_th: จำนวนบรรทัดสูงสุดที่จะเก็บไว้

source: NB! Large values may cause poor performance!
cs_cz: !Velké hodnoty mohou způsobit nízký výkon!
th_th: หมายเหตุ! ค่าขนาดใหญ่อาจทำให้ประสิทธิภาพต่ำ!

source: Maximum length of line fragments before squeezing
cs_cz: Maximální délka řádky před zalomením
th_th: ความยาวสูงสุดของเศษเส้นก่อนบีบ

source: Open evaluated values in Object inspector
cs_cz: Otevřít vyhodnocené hodnoty v Inspektoru objektů
th_th: เปิดค่าที่ประเมินในตัวตรวจสอบออปเจ็ค

source: Running current script in terminal
cs_cz: Spustit aktuální skript v terminálu
th_th: เรียกใช้สคริปต์ปัจจุบันในเทอร์มินัล

source: Present Python REPL after program ends
cs_cz: Po skončení programu zobrazí Python REPL
th_th: นำเสนอ Python REPL หลังจากสิ้นสุดโปรแกรม

source: Keep terminal window open after Python process ends
cs_cz: Nechat otevřený terminál po ukončení Python programu
th_th: เปิดหน้าต่างเทอร์มินัลไว้หลังจากกระบวนการ Python สิ้นสุดลง

source: NB! Automatic closing needs to be enabled in Terminal's settings (Profiles → Shell → When the shell exits)
cs_cz: Pozn. V nastavení terminálu musí být povoleno automatické zavírání (Profily → Shell → Když skočí z shellu)
th_th: หมายเหตุ! ต้องเปิดใช้งานการปิดอัตโนมัติในการตั้งค่าของเทอร์มินัล (โปรไฟล์ → เชลล์ → เมื่อออกจากเชลล์)

source: Terminal
cs_cz: Terminál
th_th: เทอร์มินัล

source: UI theme
cs_cz: Motiv UI
th_th: ธีม UI

source: Syntax theme
cs_cz: Motiv syntaxe
th_th: ธีมไวยากรณ์

source: Editor font
cs_cz: Font editoru
th_th: ฟอนต์ของตัวแก้ไข

source: IO font
cs_cz: IO písmo
th_th: ฟอนต์ IO

source: Preview
cs_cz: Náhled
th_th: ตัวอย่าง

source: This is a comment
cs_cz: Tohle je komentář
th_th: นี่คือคอมเมนต์

source: The answer is
cs_cz: Odpověď je
th_th: คำตอบคือ

source: blah, blah
cs_cz: bla, bla
th_th: บลา บลา

source: NB! Some style elements change only after restarting Thonny!
cs_cz: !Některé změny stylu se projeví až po restartu Thonny!
th_th: หมายเหตุ! องค์ประกอบสไตล์บางอย่างเปลี่ยนแปลงหลังจากรีสตาร์ท Thonny!

source: Enter an integer
cs_cz: Zapište celé číslo
th_th: ใส่จำนวนเต็ม

source: Theme & Font
cs_cz: Motiv & Písmo
th_th: ธีมและฟอนต์

source: Open Thonny program folder...
cs_cz: Otevřít adresář programu Thonny
th_th: เปิดโฟลเดอร์โปรแกรม Thonny...

source: Open Thonny data folder...
cs_cz: Otevřít adresář dat Thonny
th_th: เปิดโฟลเดอร์ข้อมูล Thonny...

source: Back to current frame
cs_cz: Zpět k aktuálnímu snímku
th_th: กลับไปยัง เฟรมปัจจุบัน

source: Back to %s
cs_cz: Zpět na %s
th_th: กลับไปยัง %s

source: Variables
cs_cz: Proměnné
th_th: ตัวแปร

source: CircuitPython (generic)
th_th: CircuitPython (ทั่วไป)

source: Thonny's Python
cs_cz: Thonnyho Python
th_th: Python ของ Thonny

source: NB! Thonny only supports Python %s and later
cs_cz: Poznámka: Thonny podporuje jen Python %s a novější
th_th: หมายเหตุ Thonny รองรับ Python %s เท่านั้นและใหม่กว่า

source: NB! File selection button may not work properly when selecting executables from a virtual environment. In this case choose the 'activate' script instead of the interpreter (or enter the path directly to the box)!
th_th: หมายเหตุ! ปุ่มเลือกไฟล์อาจทำงานไม่ถูกต้องเมื่อเลือกไฟล์ปฏิบัติการ จากสภาพแวดล้อมเสมือนจริง ในกรณีนี้ให้เลือกสคริปต์ 'เปิดใช้งาน' แทน ของอินเตอร์พรีทเตอร์ (หรือป้อนเส้นทางไปยังกล่องโดยตรง)!

source: Python interpreters
cs_cz: Interpretery Pythonu
th_th: Python อินเตอร์พรีทเตอร์

source: Select empty directory for new virtual environment
cs_cz: Vyberte prázdný adresář pro nové virtuální prostředí
th_th: เลือกไดเร็กทอรีว่างสำหรับสภาพแวดล้อมเสมือนใหม่

source: Bad directory
cs_cz: Špatný adresář
th_th: ไดเรกทอรีที่ไม่ดี

source: Selected directory is not empty. Select another or cancel.
cs_cz: Vybraný adresář není prázdný. Vyberte jiný adresář.
th_th: ไดเรกทอรีที่เลือกไม่ว่าง เลือกไดเรกทอรีอื่นหรือยกเลิก

source: Creating virtual environment
cs_cz: Vytvářím virtuální prostředí
th_th: การสร้างสภาพแวดล้อมเสมือนจริง

source: Remote Python 3 (SSH)
cs_cz: Vzdálený Python 3 (SSH)
th_th: Python ระยะไกล 3 (SSH)

source: Home
cs_cz: Domů
th_th: บ้าน

source: Help contents
cs_cz: Obsah nápovědy
th_th: เนื้อหาช่วยเหลือ

source: Make sure MicroPython has been installed to your micro:bit.
cs_cz: Ujistěte se že na micro:bit je nainstalován MicroPython
th_th: ตรวจสอบให้แน่ใจว่าได้ติดตั้ง MicroPython ลงใน micro:bit ของคุณแล้ว

source: Don't forget that main.py only works without embedded main script.
cs_cz: Nezapomeňte, že main.py funguje pouze bez vloženého hlavního skriptu.
th_th: อย่าลืมว่า main.py ใช้งานได้โดยไม่ต้องฝังสคริปต์หลักเท่านั้น

source: MicroPython (generic)
th_th: MicroPython (ทั่วไป)

source: CircuitPython device
cs_cz: CircuitPython zařízení
th_th: อุปกรณ์ CircuitPython

source: MicroPython device
cs_cz: MicroPython zařzení
th_th: อุปกรณ์ MicroPython

source: Not connected
th_th: ไม่ได้เชื่อมต่อ

source: Port or WebREPL
th_th: พอร์ตหรือ WebREPL

source: Port
th_th: พอร์ต

source: Try to detect port automatically
cs_cz: Zkusti detekovat port automaticky
th_th: พยายามตรวจจับพอร์ตโดยอัตโนมัติ

source: Interrupt working program on connect
th_th: โปรแกรมการทำงานขัดจังหวะในการเชื่อมต่อ

source: Synchronize device's real time clock
th_th: ซิงโครไนซ์อุปกรณ์นาฬิกาเวลาจริง

source: Use local time in real time clock
th_th: ใช้เวลาท้องถิ่นในนาฬิกาแบบเรียลไทม์

source: Restart interpreter before running a script
cs_cz: Restartuje interpretr než spustíte skript
th_th: รีสตาร์ทอินเตอร์พรีทเตอร์ก่อนเรียกใช้สคริปต์

source: Connect your device to the computer and select corresponding port below
cs_cz: Připojte zařízení k počítači a vyberte odpovídající port
th_th: เชื่อมต่ออุปกรณ์ของคุณกับคอมพิวเตอร์และเลือกพอร์ตที่เกี่ยวข้องด้านล่าง

source: look for your device name, "USB Serial" or "UART"
cs_cz: zkontrolujte název zařízení, např. "USB Serial" nebo "UART"
th_th: ค้นหาชื่ออุปกรณ์ของคุณ "USB Serial" หรือ "UART"

source: If you can't find it, you may need to install proper USB driver first.
cs_cz: Pokud jej nemůžete najít, možná musíte nedříve nainstalovat správný ovladač.
th_th: หากหาไม่พบ คุณอาจต้องติดตั้งไดรเวอร์ USB ที่เหมาะสมก่อน

source: Password
cs_cz: Heslo
th_th: รหัสผ่าน

source: This doesn't look like MicroPython/CircuitPython package. Are you sure you want to install it?
cs_cz: Tohle nevypadá jako balíček pro MicroPython/CircuitPython. Jste si jistí, že jej chcete nainstalovat.
th_th: สิ่งนี้ดูไม่เหมือนแพ็คเกจ Micropython / Circuitpython คุณแน่ใจหรือว่าต้องการติดตั้ง?

source: no absolute lib directory in sys.path
th_th: ไม่มีไดเรกทอรี lib แน่นอนใน sys.path

source: Print...
cs_cz: Tisk...
th_th: พิมพ์...

source: Open system shell...
cs_cz: Otevřít systémový shell
th_th: เปิดเชลล์ระบบ...

source: Run
cs_cz: Běh

source: Auto-complete
cs_cz: Automatické doplňování

source: Toggle comment
cs_cz: Přepnout komentáře

source: Source code
cs_cz: Zdrojový text

source: Case sensitive
cs_cz: Citlivé na velikost

source: MicroPython (local)
cs_cz: MicroPython (lokální)
